tutorials/consistentSolvers/airfoil/alpha0/consistentPimpleFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        tolerance       1e-7;
        relTol          0.005;
        preconditioner  DIC;
        maxIter		500;
    }

    "(U|k|omega)"
    {
        solver          BiCGStab;
        preconditioner  DILU;
        nSweeps         1;
        tolerance       1e-9;
        relTol          0.0;
        minIter         1;
    }
}

PIMPLE
{
    nOuterCorrectors 12;
    nCorrectors 10;
    nNonOrthogonalCorrectors 0;
    pRefPoint      (-13 0 0);
    pRefValue       0;

    momentumTolerance    1e-3;
    innerTolerance       5e-5;
}

relaxationFactors
{
    p               	1;
    U               	1;
    k					1;
    omega				1;
}


// ************************************************************************* //
